llgt     CSECT
         BASR  15,0
         USING *,15
         LLGT  5,HIWORD
         XDUMP 0
         BR    14
         DS    0F
HIWORD   DC    X'FFFFFFFF'
         END