         CSECT
         BALR  15,0
         USING *,15
         LH    10,=H'123'  d123=x7b
         STH   10,RESULT
         XDUMP 0
         BR    14
         DS    0F
RESULT   DC    H'0'
         END