*        OR
*        00000011 11000000
*        01010101 01010101
*        -------- --------
*        01010111 11010101
         CSECT
         BASR  15,0
         USING *,15
         OI    OIVAL,B'00000011'
         OC    OCVAL(2),=B'00000011,11000000'         
         XDUMP 0
         BR    14
         DS    0F
         DC    C'>>>>'
OIVAL    DC    B'01010101'
         DC    C'<<<>>>>'
OCVAL    DC    2B'01010101'
         DC    C'<<<'
         END

