         START 0
ENTRY    BASR  15,0         Load address of next inst in R15
         IC    10,14(,15)   Load char to R10   
         XDUMP 0            Dump memory
         BR    14           Branch to R14 address (return)
         DS    0F
         DC    X'99'
         END