         CSECT
         BASR  15,0
         USING *,15
         LA    5,b'00001000'  R5=X'08'
         XDUMP 0
         SLL   5,1   Shift R5 left 1
         XDUMP 0     R5=b'00010000' = X'10'
         BR    14
         END