unpk     CSECT
         BASR  15,0
         USING *,15
         UNPK  zoned(8),packed(8)
         XDUMP 0
         BR    14
         DS    0F
packed   DC    pl8'-21'
zoned    dc    zl8'0'
         END