* XOR DEMO       
* S2:  00000011 11000000
* S1:  01010101 01010101
*      -------- --------
* RES: 01010110 10010101

         CSECT
         BALR  15,0
         USING *,15
         XC    XCVAL(2),=B'00000011,11000000'         
         LA    3,b'01010101'
         LA    4,b'00000011'
         XR    3,4
         XDUMP 0
         BR    14
         DS    0F
         DC    C'>>>>'
OIVAL    DC    B'01010101'
         DC    C'<<<>>>>'
XCVAL    DC    2B'01010101'
         DC    C'<<<'
         END
